{
  "sentences": [
    "Appendix\nMathematics is made of arguments (reasoned discourse that is, not crockery-\nthrowing).",
    "This section sketches the background material and argument tech-\nniques that we use in the book.\n",
    "This section informally outlines the topics, skipping proofs.\n",
    "For more,\n[Velleman2] is excellent.",
    "Two other sources, available online, are [Hefferon]\nand [Beck].\n",
    "Statements\nFormal mathematical statements come labelled as a Theorem for major points,\na Corollary for results that follow immediately from a prior one, or a Lemma\nfor results chiey used to prove others.\n",
    "Statements can be complex and have many parts.",
    "The truth or falsity of the\nentire statement depends both on the truth value of the parts and on how the\nstatement is put together.\n",
    "Not\nWhere P is a proposition, it is not the case that P is true provided that\nP is false.",
    "For instance, n is not prime is true only when n is the product of\nsmaller integers.\n",
    "To prove that a not P statement holds, show that P is false.\n",
    "And\nFor a statement of the form P and Q to be true both halves must hold:\n7 is prime and so is 3 is true, while 7 is prime and 3 is not is false.\n",
    "To prove a P and Q, prove each half.\nOr A P or Q statement is true when either half holds: 7 is prime or 4 is prime\nis true, while 8 is prime or 4 is prime is false.",
    "In the case that both clauses of\nthe statement are true, as in 7 is prime or 3 is prime, we take the statement\nas a whole to be true.",
    "(In everyday speech people occasionally use or in an\nexclusive way  Live free or die does not intend both halves to hold  but we\nwill not use or in that way.)\n\nA-2\nTo prove P or Q, show that in all cases at least one half holds (perhaps\nsometimes one half and sometimes the other, but always at least one).\n",
    "If-then An if P then Q statement may also appear as P implies Q or P =Q\nor P is sucient to give Q or Q if P.",
    "It is true unless P is true while Q is\nfalse.",
    "Thus if 7 is prime then 4 is not is true while if 7 is prime then 4 is also\nprime is false.",
    "(Contrary to its use in casual speech, in mathematics if P then\nQ does not connote that P precedes Q or causes Q.)\nNote this consequence of the prior paragraph: if P is false then if P then Q\nis true irrespective of the value of Q: if 4 is prime then 7 is prime and if 4 is\nprime then 7 is not are both true statements.",
    "(They are vacuously true.)",
    "Also\nobserve that if P then Q is true when Q is true: if 4 is prime then 7 is prime\nand if 4 is not prime then 7 is prime are both true.\n",
    "There are two main ways to establish an implication.\n",
    "The rst way is\ndirect: assume that P is true and use that assumption to prove Q. For instance,\nto show if a number is divisible by 5 then twice that number is divisible by\n10 we can assume that the number is 5n and deduce that 2(5n) = 10n.",
    "The\nindirect way is to prove the contrapositive statement: if Q is false then P is\nfalse (rephrased, Q can only be false when P is also false).",
    "Thus to show if a\nnatural number is prime then it is not a perfect square we can argue that if it\nwere a square p = n2 then it could be factored p = n  n where n < p and so\nwouldnt be prime (p = 0 or p = 1 dont satisfy",
    "n < p",
    "but they are nonprime).\n",
    "Equivalent statements\nSometimes, not only does P imply Q but also Q implies P.\nSome ways to say this are: P if and only if Q, P iQ, P and Q are logically\nequivalent, P is necessary and sucient to give Q, P Q.",
    "An example is\nan integer is divisible by ten if and only if that number ends in 0.\n",
    "Although in simple arguments a chain like P if and only if R, which holds if\nand only if S . . . ",
    "may be practical, to prove that statements are equivalent we\nmore often prove the two halves if P then Q and if Q then P separately.\n",
    "Quantiers\nCompare these statements about natural numbers: there is a natural number x\nsuch that x is divisible by x2 is true, while for all natural numbers x, that x is\ndivisible by x2 is false.",
    "The prexes there is and for all are quantiers.\n",
    "For all\nThe for all prex is the universal quantier, symbolized .\nThe most straightforward way to prove that a statement holds in all cases is\nto prove that it holds in each case.",
    "Thus to show that every number divisible by\np has its square divisible by p2, take a single number of the form pn and square\nit (pn)2 = p2n2.",
    "This is a typical element proof.",
    "(In this kind of argument\nbe careful not to assume properties for that element other than the ones in the\n\nA-3\nhypothesis.",
    "This argument is wrong: If n is divisible by a prime, say 2, so that\nn = 2k for some natural number k, then n2 = (2k)2 = 4k2 and the square of n\nis divisible by the square of the prime.",
    "That is a proof for the special case p = 2\nbut it isnt a proof for all p.",
    "Contrast it with a correct one: If n is divisible\nby a prime",
    "so that n = pk for some natural number k then n2 = (pk)2 = p2k2\nand so the square of n is divisible by the square of the prime.)\n",
    "There exists\nThe there exists prex is the existential quantier, symbolized .\n",
    "We can prove an existence proposition by producing something satisfying\nthe property: for instance, to settle the question of primality of 225",
    "+ 1, Euler\nexhibited the divisor 641[Sandifer].",
    "But there are proofs showing that something\nexists without saying how to nd it; Euclids argument given in the next\nsubsection shows there are innitely many primes without giving a formula\nnaming them.\n",
    "Finally, after Are there any? we often ask How many?\nThat is, the\nquestion of uniqueness often arises in conjunction with the question of existence.\n",
    "Sometimes the two arguments are simpler if separated so note that just as\nproving something exists does not show that it is unique, neither does proving\nthat something is unique show that it exists.\n",
    "Techniques of Proof\nWe have many ways to prove mathematical statements.",
    "Here we will outline\ntwo techniques that we use often, and that might not come naturally, even to a\nperson with a technical turn of mind.\n",
    "Induction\nMany proofs are iterative, Heres why the statement is true for the\nnumber 0, it then follows for 1 and from there to 2 . . .",
    "These are proofs by\nmathematical induction.",
    "We will see two examples.\n",
    "We will rst prove that 1 + 2 + 3 +    + n = n(n + 1)/2.",
    "That formula has\na natural number variable n that is free, meaning that setting n to be 1, or\n2, etc., gives a family of cases of the statement: rst that 1 = 1(2)/2, second\nthat 1 + 2 = 2(3)/2, etc.",
    "Our induction proofs involve statements with one free\nnatural number variable.\n",
    "Each such proof has two steps.",
    "In the base step we show that the statement\nholds for some intial number",
    "Often this step is a routine verication.\n",
    "The second step, the inductive step, is more subtle; we will show that this\nimplication holds:\n",
    "If the statement holds from n = i up to and including n = k\nthen the statement holds also in the n = k + 1 case\n()\n(the rst line is the inductive hypothesis).",
    "Completing both steps proves that\nthe statement is true for all natural numbers greater than or equal to i.\n\nA-4\n",
    "For the sum of the initial n numbers statement the intuition behind the\nprinciple is that rst, the base step directly veries the statement for the case\nof the initial number n = 1.",
    "Then, because the inductive step veries the\nimplication () for all k, that implication applied to k = 1 gives that the\nstatement is true for the case of the number n = 2.",
    "Now, with the statement\nestablished for both 1 and 2, apply () again to conclude that the statement is\ntrue for the number n = 3.",
    "In this way, we bootstrap to all numbers n 1.\n",
    "Here is a proof of 1 + 2 + 3 +    + n = n(n + 1)/2, with separate paragraphs\nfor the base step and the inductive step.\n",
    "For the base step we show that the formula holds when n = 1.",
    "Thats\neasy; the sum of the rst 1 natural number equals 1(1 + 1)/2.\n",
    "For the inductive step, assume the inductive hypothesis that the formula\nholds for the numbers n = 1, n = 2, . .",
    ", n = k with k 1.",
    "That is,\nassume 1 = 1(1)/2, and 1 + 2 = 2(3)/2, and 1 + 2 + 3 = 3(4)/2, through\n1 + 2 +   ",
    "+ k = k(k + 1)/2.",
    "With that, the formula holds also in the\nn = k + 1 case:\n1 + 2 +   ",
    "+ (k + 1) = k(k + 1)\n2\n+ (k + 1) = (k + 1)(k + 2)\n2\n(the rst equality follows from the inductive hypothesis).\n",
    "Here is another example, proving that every integer greater than or equal to\n2 is a product of primes.\n",
    "The base step is easy: 2 is the product of a single prime.\n",
    "For the inductive step assume that each of 2, 3, . . .",
    ", k is a product of primes,\naiming to show k+1 is also a product of primes.",
    "There are two possibilities.\n",
    "First, if k + 1 is not divisible by a number smaller than itself then it is a\nprime and so is the product of primes.",
    "The second possibility is that k",
    "+ 1\nis divisible by a number smaller than itself, and then by the inductive\nhypothesis its factors can be written as a product of primes.",
    "In either case\nk + 1 can be rewritten as a product of primes.\n",
    "Contradiction\nAnother technique of proof is to show that something is true by\nshowing that it cannot be false.",
    "A proof by contradiction assumes that the\nproposition is false and derives some contradiction to known facts.\n",
    "The classic example of proof by contradiction is Euclids argument that there\nare innitely many primes.\n",
    "Suppose that there are only nitely many primes p1, . . .",
    "Consider the\nnumber p1 p2 . . .",
    "None of the primes on the supposedly exhaustive\nlist divides this number evenly since each leaves a remainder of 1.",
    "But\nevery number is a product of primes so this cant be.",
    "Therefore there\ncannot be only nitely many primes.\n\n",
    "A-5\nAnother example is this proof that\n\n2 is not a rational number.\n",
    "Suppose that\n\n2 = m/n, so that 2n2 = m2.",
    "Factor out any 2s, giving\nn = 2kn  n and m = 2km  m.",
    "2  (2kn  n)2 = (2km  m)2\nThe Prime Factorization Theorem says that there must be the same number\nof factors of 2 on both sides, but there are an odd number of them",
    "+ 2kn\non the left and an even number 2km on the right.",
    "Thats a contradiction,\nso a rational number with a square of 2 is impossible.\n",
    "Sets, Functions, and Relations\nThe material here forms the backdrop, the vocabulary, for all of the development\nthat we do.\n",
    "Sets Mathematicians often work with collections.",
    "The most commonly-used kind\nof collection is a set.",
    "Sets are characterized by the Principle of Extensionality:\ntwo sets with the same elements are equal.",
    "Because of this, the order of the\nelements does not matter {2, } = {, 2}, and repeats collapse {7, 7} = {7}.\n",
    "We can describe a set using a listing between curly braces {1, 4, 9, 16} (as\nin the prior paragraph), or by using set-builder notation {x | x5 3x3 + 2 = 0}\n(read the set of all x such that . . .",
    "We name sets with capital roman letters;\nfor instance the set of primes is P = {2, 3, 5, 7, 11, . . .",
    "(except that a few sets\nare so important that their names are reserved, such as the real numbers R and\nthe complex numbers C).",
    "To denote that something is an element, or member,)\nof a set we use , so that 7 {3, 5, 7} while 8 {3, 5, 7}.\n",
    "We say that A is a subset of B, written A B, when x A implies that\nx B.",
    "In this book we use  for the proper subset relationship that A is a\nsubset of B but A = B (some authors use this symbol for any kind of subset,\nproper or not).",
    "An example is {2, } {2, , 7}.",
    "These symbols may be ipped,\nfor instance {2, , 5} {2, 5}.\n",
    "Because of Extensionality, to prove that two sets are equal A = B show that\nthey have the same members.",
    "Often we do this by showing mutual inclusion,\nthat both A B and A B. Such a proof will have a part showing that if\nx A then x B, and a second part showing that if x B then x A.\nWhen a set has no members then it is the empty set { }, symbolized .\nAny set has the empty set for a subset by the vacuously true property of the\ndenition of implication.\n",
    "Diagrams\nWe picture basic set operations with a Venn diagram.",
    "This shows\nx P.\n\nA-6\nP\nx\nThe outer rectangle contains the universe of all objects under discussion.",
    "For\ninstance, in a statement about real numbers, the rectangle encloses all members\nof R. The set is pictured as a circle, enclosing its members.\n",
    "Here is the diagram for P Q.",
    "It shows that if x P then x Q.\nP\nQ\nSet Operations\nThe union of two sets is P Q",
    "= {x | (x P) or (x Q)}.",
    "The\ndiagram shows that an element is in the union if it is in either of the sets.\n",
    "P\nQ\nThe intersection is P Q",
    "= {x | (x P) and (x Q)}.\n",
    "P\nQ\nThe complement of a set P is Pcomp = {x | x P}\nP\nx\nMultisets As described above, a set is a collection in which order does not matter,\nso that the sets {2, } and {, 2} are equal, and in which repeats collapse, so\nthat the sets {7, 7} and {7} are equal.\n\n",
    "A-7\nA collection that is like a set in that order does not matter, but in which\nrepeats do not collapse, is a multiset.",
    "(Note that we use the same curly brackets\nnotation {. . .",
    "as for sets.)",
    "Thus the multiset {1, 2, 2} diers from the multiset\n{1, 2}.",
    "Because order does not matter, these multisets are all equal: {1, 2, 2},\n{2, 1, 2}, and {2, 2, 1}.",
    "In this text we only mention multisets in a remark so\ngoing into how to do subsets, unions, or intersections, is beyond our scope.\n",
    "In addition to sets and multisets, we also use collections where order\nmatters and where repeats do not collapse.",
    "These are sequences, denoted with\nangle brackets: 2, 3, 7= 2, 7, 3. A sequence of length 2 is an ordered pair,\nand is often written with parentheses: (, 3).",
    "We also sometimes say ordered\ntriple, ordered 4-tuple, etc.",
    "The set of ordered n-tuples of elements of a set A\nis denoted An.",
    "Thus R2 is the set of pairs of reals.\n",
    "Functions\nA function or map f: D C is is an association between input\narguments x D and output values f(x) C subject to the the requirement that\nthe function must be well-dened, that x suces to determine f(x).",
    "Restated,\nthe condition is that if x1 = x2 then f(x1) = f(x2).\n",
    "The set of all arguments D is fs domain and the set of output values is\nits range R(f).",
    "Often we dont work with the range and instead work with\na convenient superset, the codomain C. For instance, we might describe the\nsquaring function with s: R R instead of s: R R+ {0}.\n",
    "We picture functions with a bean diagram.\n",
    "The blob on the left is the domain while on the right is the codomain.",
    "The\nfunction associates the three points of the domain with three in the codomain.\n",
    "Note that by the denition of a function every point in the domain is associated\nwith a unique point in the codomain, but the converse neednt be true.\n",
    "The association is arbitrary; no formula or algorithm is required, although in\nthis book there typically is one.",
    "We often use y to denote f(x).",
    "We also use the\nnotation x\nf\n716x2 100, read x maps under f to 16x2 100 or 16x2 100\nis the image of x.\n",
    "A map such as x 7sin(1/x) is a combinations of simpler maps, here g(y) =\nsin(y) applied to the image of f(x)",
    "The composition of g: Y Z with\nf: X Y, is the map sending x X to g( f(x) )",
    "It is denoted g f: X",
    "Z.\nThis denition only makes sense if the range of f is a subset of the domain of g.\n\nA-8\nAn identity map id:",
    "Y Y dened by id(y) = y has the property that for\nany f: X Y, the composition id f is equal to f.",
    "So an identity map plays the\nsame role with respect to function composition that the number 0 plays in real\nnumber addition or that 1 plays in multiplication.\n",
    "In line with that analogy, we dene a left inverse of a map f: X Y to be\na function g: range(f) X such that g f is the identity map on X. A right\ninverse of f is a h: Y X such that f h is the identity.\n",
    "For some fs there is a map that is both a left and right inverse of f.",
    "If such\na map exists then it is unique because if both g1 and g2 have this property\nthen g1(x) = g1 (f g2) (x) = (g1 f) g2 (x) = g2(x) (the middle equality\ncomes from the associativity of function composition)",
    "so we call it a two-sided\ninverse or just the inverse, and denote it f1.",
    "For instance, the inverse of\nthe function f: R R given by f(x) = 2x 3 is the function f1 : R R given\nby f1(x) = (x + 3)/2.\n",
    "The superscript notation for function inverse f1 ts into a larger scheme.\n",
    "Functions with the same codomain as domain f: X X can be iterated, so that\nwe can consider the composition of f with itself: f f, and f f f, etc.",
    "We write\nf f as f2 and f f f as f3, etc.",
    "Note that the familiar exponent rules for real\nnumbers hold: fi fj = fi+j and (fi)j = fij.",
    "Then where f is invertible, writing\nf1 for the inverse and f2 for the inverse of f2, etc., gives that these familiar\nexponent rules continue to hold, since we dene f0 to be the identity map.\n",
    "The denition of function requires that for every input there is one and only\none associated output value.",
    "If a function f: D C has the additional property\nthat for every output value there is at least one associated input value  that is,\nthe additional property that fs codomain equals its range C = R(f)  then the\nfunction is onto.\n",
    "A function has a right inverse if and only if it is onto.",
    "(The f pictured above\nhas a right inverse",
    "g: C D given by following the arrows backwards, from\nright to left.",
    "For the codomain point on the top, choose either one of the arrows\nto follow.",
    "With that, applying g rst followed by f takes elements y C to\nthemselves, and so is the identity function.)\n",
    "If a function f: D C has the property that for every output value there is\nat most one associated input value  that is, if no two arguments share an image\nso that f(x1)",
    "= f(x2) implies that x1 = x2  then the function is one-to-one.\n",
    "The bean diagram from earlier illustrates.\n\n",
    "A-9\nA function has a left inverse if and only if it is one-to-one.",
    "(In the picture dene\ng: C D to follow the arrows backwards for those y C that are at the end of\nan arrow, and to send the point to an arbitrary element in D otherwise.",
    "Then\napplying f followed by g to elements of D will act as the identity.)\n",
    "By the prior paragraphs, a map has a two-sided inverse if and only if that map\nis both onto and one-to-one.",
    "Such a function is a correspondence.",
    "It associates\none and only one element of the domain with each element of the codomain.\n",
    "Because a composition of one-to-one maps is one-to-one, and a composition of\nonto maps is onto, a composition of correspondences is a correspondence.\n",
    "We sometimes want to shrink the domain of a function.",
    "For instance, we\nmay take the function f: R R given by f(x)",
    "and, in order to have an\ninverse, limit input arguments to nonnegative reals f: R+ {0} R. Then f is\nthe restriction of f to the smaller domain.\n",
    "Relations\nSome familiar mathematical things, such as < or =, are most\nnaturally understood as relations between things.",
    "A binary relation on a set\nA is a set of ordered pairs of elements of A. For example, some elements of\nthe set that is the relation < on the integers are (3, 5), (3, 7), and (1, 100).\n",
    "Another binary relation on the integers is equality; this relation is the set\n{. . .",
    ", (1, 1), (0, 0), (1, 1), . . .}.",
    "Still another example is closer than 10, the set\n{(x, y) | |x y| < 10}.",
    "Some members of this relation are (1, 10), (10, 1), and\n(42, 44).",
    "Neither (11, 1) nor (1, 11) is a member.\n",
    "Those examples illustrate the generality of the denition.\n",
    "All kinds of\nrelationships (e.g., both numbers even or rst number is the second with the\ndigits reversed) are covered.\n",
    "Equivalence Relations\nWe shall need to express that two objects are alike in\nsome way.",
    "They arent identical, but they are related (e.g., two integers that\ngive the same remainder when divided by 2).\n",
    "A binary relation {(a, b), . . .} is an equivalence relation when it satises\n(1) reexivity: any object is related to itself, (2) symmetry: if a is related\nto b then b is related to a, and (3) transitivity: if a is related to b and b is\nrelated to c then a is related to c. Some examples (on the integers): = is an\nequivalence relation, < does not satisfy symmetry, same sign is a equivalence,\nwhile nearer than 10 fails transitivity.\n",
    "Partitions\nIn the same sign relation {(1, 3), (5, 7), (0, 0), . . .",
    "there are three\n\nA-10\nkinds of pairs, pairs with both numbers positive, pairs with both negative, and\nthe one pair with both zero.",
    "So integers fall into exactly one of three classes,\npositive, or negative, or zero.\n",
    "A partition of a set is a collection of subsets {S0, S1, S2, . . .}",
    "such that\nevery element of S is an element of a subset S1 S2    = and overlapping\nparts are equal: if Si Sj = then Si = Sj.",
    "Picture that is decomposed into\nnon-overlapping parts.\n. .",
    "S0\nS1\nS2\nS3\n",
    "Thus the prior paragraph says that same sign partitions the integers into the\nset of positives, the set of negatives, and the set containing only zero.",
    "Similarly,\nthe equivalence relation = partitions the integers into one-element sets.\n",
    "Another example is the set of strings consisting of a number, followed by\na slash, followed by a nonzero number = {n/d | n, d Z and d = 0}.",
    "Dene\nSn,d by: n/d Sn,d if nd = nd.",
    "Checking that this is a partition of is\nroutine (observe for instance that S4,3 = S8,6).",
    "This shows some parts, listing\nin each a couple of its innitely many members.\n. . .\n.",
    "8/6\nEvery equivalence relation induces a partition, and every partition is induced\nby an equivalence.",
    "(This is routine to check.)",
    "Below are two examples.\n",
    "Consider the equivalence relationship between two integers of gives the same\nremainder when divided by 2, the set P = {(1, 3), (2, 4), (0, 0), . . .}.",
    "In the set P\nare two kinds of pairs, the pairs with both members even and the pairs with both\nmembers odd.",
    "This equivalence induces a partition where the parts are found\nby: for each x we dene the set of numbers related to it Sx = {y | (x, y) P}.\n",
    "The parts are {. . .",
    ", 3, 1, 1, 3, . . .} and {. . .",
    ", 2, 0, 2, 4, . . .}.",
    "Each part can be\nnamed in many ways; for instance, {. . .",
    ", 3, 1, 1, 3, . . .} is S1 and also is S3.\n",
    "Now consider the partition of the natural numbers where two numbers are\nin the same part if they leave the same remainder when divided by 10, that\nis, if they have the same least signicant digit.",
    "This partition is induced by\nthe equivalence relation R dened by: two numbers n, m are related if they\nare together in the same part.",
    "For example, 3 is related to 33, but 3 is not\n\nA-11\nrelated to 102.",
    "Verifying the three conditions in the denition of equivalence\nare straightforward.\n",
    "We call each part of a partition an equivalence class.",
    "We sometimes pick a\nsingle element of each equivalence class to be the class representative.\n. . .\n",
    "\n\n\n\nUsually when we pick representatives we have some natural scheme in mind.",
    "In\nthat case we call them the canonical representatives.",
    "An example is that two\nfractions 3/5 and 9/15 are equivalent.",
    "In everyday work we often prefer to use\nthe simplest form or reduced form fraction 3/5 as the class representative.\n. . .\n",
    "0/1\n1/1\n1/2\n4/3\n\n\nBibliography\n[Ackerson] R. H. Ackerson, A Note on Vector Spaces, American Mathematical\nMonthly, vol."
  ]
}